In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [5]:
'''
Database Host/Server: lmusql.ceeey3c2byg6.us-east-1.rds.amazonaws.com
Database Username: analyst
Database Password: lmumba630!
Database Name: sakila
'''

'\nDatabase Host/Server: lmusql.ceeey3c2byg6.us-east-1.rds.amazonaws.com\nDatabase Username: analyst\nDatabase Password: lmumba630!\nDatabase Name: sakila\n'

In [6]:
# establish a connection to the MySQL database

# engine = create_engine('mysql+mysqldb://DATABASE_USERNAME:DATABASE_PASSWORD@DATABASE_HOST/DATABASE_NAME')
# DATABASE_USERNAME: lontoklm_dba
    # created in lmu.build when making our first database
    # format: LMU_BUILD_USERNAME_dba
# DATABASE_PASSWORD: lmumba630!
    # same for everyone
# DATABASE_HOST: lontok.lmu.build
    # your lmu.build Primary Domain
# DATABASE_NAME: lontoklm_bi_test_01
    # format: LMU_BUILD_USERNAME_bi_test_01

engine = create_engine('mysql+mysqldb://analyst:lmumba630!@lmusql.ceeey3c2byg6.us-east-1.rds.amazonaws.com/sakila')

In [12]:
# assign the SQL statement to a variable
# use triple quotes to enclose multi-line variable values
sql = '''
SELECT rating, AVG(length) AS avg_length
FROM film
WHERE release_year = 2006
GROUP BY rating
'''

In [13]:
# execute the SQL against the database connection established in the engine variable
# assign the SQL results to a DataFrame
df = pd.read_sql(sql, engine)

In [14]:
df.head()

  rating  avg_length
0      G    111.0506
1     PG    112.0052
2  PG-13    120.4439
3      R    118.6615
4  NC-17    113.2286